# правильное окончание для слова 'программисты'.
# 1 программист      31 программист , 51 ..., 71 ..., 91 ...
# 2 программиста     32 программиста, 52 ..., 72 ..., 92 ...
# 5 программистов    33 программиста, 53 ..., 73 ..., 93 ...
# 21 программист     34 программиста, 54 ..., 74 ..., 94 ...
# 22 программиста
# 25 программистов
# 30 программистов

count = int(input())
prog = 'программист'

if (count//10)%10 == 1:
    print(count, prog + 'ов')
else:
    if (count % 10 == 0) or (5 <= count % 10 <= 9):
        print(count, prog + 'ов')
    elif count % 10 == 1:
        print(count, prog)
    elif 2 <= count % 10 <= 4:
        print(count, prog + 'а')
