PROGRAM COUNT_BIG_SUM;

{------------------------------------------------------------------------------>
^        k                  |                                                  |
|      10                   |               k-1   k                            |
|  S = E i, k принадлежит N |  S(k) = 5 * 10   (10 + 1);                       |
|   k  i=1                  |                                                  v
<------------------------------------------------------------------------------}

PROCEDURE S(k: word):= WriteLn(2 * ('5' + '0' * (k-1)));

BEGIN
    var k:= ReadLnInteger('Введите степень десятки');
    S(k);
END.
