PROGRAM String_Is_more_than_255;


BEGIN
    { По умолчанию, количество символов в строке равно 255. Однако, это нужно  }
    { для совместимости со старыми программами. Есть ещё новые строки, от .Net,}
    { их длина ограничивается двумя гигабайтами. Однако, в PascalABC.NET они   }
    { отличаются, так как можно их изменять и копировать прямым присваиванием, }
    { а нумерация символов начинается с 1                                      }
    {                                                                          }

END.
