#Создать простейший калькулятор, умеющий складывать, вычитать, умножать и делить два
#числа

print("Добро пожаловать в простейший калькулятор.")
print("Введите \'add\', чтобы сложить")
print("Введите \'substract\', чтобы вычесть")
print("Введите \'multiply\', чтообы умножить")
print("Введите \'divide\', чтобы разделить")

user = input("\n:")


