'''
    Шахматная ладья ходит по горизонтали или вертикали. Даны две различные клетки шахматной доски, 
    определите, может ли ладья попасть с первой клетки на вторую одним ходом. Программа получает на вход 
    четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки сначала для первой клетки, потом 
    для второй клетки. Программа должна вывести "YES", если из первой клетки ходом ладьи можно попасть во 
    вторую или "NO" в противном случае. 

    4   NO
    4
    5
    5

    4   YES
    4
    5
    4

'''
a,b,c,d = int(input()), int(input()), int(input()), int(input())
if a == c or b == d:
    print("YES")
else:
    print("NO")
